#### ViewDiscipline Enumeration

---

|  |
| --- |
| See Also |

Discipline of the view

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ViewDiscipline ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ViewDiscipline ``` |

| Visual C++ |
| --- |
| ``` public enum class ViewDiscipline ``` |

# Members

| Member name | Description |
| --- | --- |
| Architectural | Architectural |
| Structural | Structural |
| Mechanical | Mechanical |
| Electrical | Electrical |
| Plumbing | Plumbing |
| Coordination | Coordination |

# See Also

Autodesk.Revit.DB Namespace